[
"Where did you grow up?",
"Do you have any pets?",
"Do you have any siblings?",
"Do you know what your your name means?",
"What type of phone do you have?",
"What did you do this past weekend?",
"What are your plans for this weekend?",
"What do you like to do in your spare time?",
"What is the first thing you do when you wake up?",
"What is the last thing you do before you go to sleep?",
"What is your middle name?",
"What was the last thing you purchased?",
"What is your favorite holiday?",
"What is your favorite day of the week?",
"If you could meet anyone in history, who would it be?",
"What do you like to do to relax?",
"Are you a saver or a spender?",
"Do you play any instruments?",
"What was your favorite children's book?",
"What is your first childhood memory?",
"What type of kid were you (e.g. spoiled, rebellious, well-behaved, quiet, obnoxious...)?",
"What is one thing you miss about being a kid?",
"What did you want to grow up to be when you were younger?",
"Where did (do) you go to school?",
"What was (is) your favorite subject?",
"What was (is) your least favorite subject?",
"What's the first thing you do after school/work?",
"Were you the class clown or teacher's pet?",
"What do you do for a living?",
"What is your dream job?",
"If you had $10 million, would you still be working/going to school?",
"What was your least favorite job that you've ever had?",
"What is something that you have gotten in trouble for at school/work?",
"What is the first think you notice about a guy or girl?",
"Have you ever been in love?",
"Do you believe in soul mates?",
"What are your turn offs?",
"Do you believe in love at first sight?",
"Do you prefer short hair or long hair on a guy/girl?",
"What do you look for in a guy/girl?",
"Who was the last person you called?",
"Would you rather be rich and never find true love or be poor and find true love?",
"Who is your favorite athlete?",
"How often do you exercise?",
"What is your favorite sports team?",
"Do you play any sports?",
"Where was the last place you went on vacation?",
"Where do you plan on going for your next vacation?",
"If you could live anywhere in the world, where would it be?",
"What countries have you traveled to?",
"What was your worst vacation experience?",
"What is your favorite drink?",
"What is your favorite food?",
"What is your favorite meal of the day?",
"Are there any foods that you dislike or will not eat?",
"Are there any foods that you would like to try?",
"What is your favorite restaurant?",
"What is your favorite pizza topping?",
"What is your favorite ice cream flavor?",
"What did you have for dinner last night?",
"What is the signature dish that you cook?",
"Who is your favorite actor?",
"What is your favorite movie of all time?",
"What was the worst movie you've ever seen?",
"What is your favorite TV show?",
"What was the last movie you've seen?",
"What type of music do you like to listen to?",
"Who is your favorite music artist?",
"What was the last book you read?",
"Who do you look up to?",
"Where do you see yourself 5 years from now?",
"What are you scared of?",
"What is the best piece of advice you've received?",
"What do your parents do for a living?",
"What is your biggest regret?",
"What is your most embarrassing moment?",
"What is the craziest thing you've ever done?",
"What are some of your short-term goals?",
"What are some of your long-term goals?",
"Do you sleep with a stuffed animal?",
"Tell me about your first car.",
"Do you drink coffee or tea?",
"If you could have any super power, what would it be?",
"If you were stranded on a deserted island and you could have only 1 item, what would it be?",
"Do you believe in luck?",
"Do you play video games?",
"Do you believe people are inherently good?",
"How often do you shower?",
"What is your favorite board game?",
"What is your favorite charity?",
"Have you ever gotten a speeding ticket?",
"Do you prefer cats or dogs?",
"Would you prefer to live in the city or a rural area?",
"What is your favorite season?",
"Do you speak any other languages?",
"Have you ever cried because you were so happy?",
"What is the best thing that happened to you during the past week?",
"What is the worst thing that happened to you during the past week?",
"Do you sing in the shower?",
"What is the most valuable thing that you own?",
"What would you do if you only had 24 hours left to live?"
]